---
type: BoundingBoxXYZ
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# BoundingBoxXYZ

`Autodesk.Revit.DB.BoundingBoxXYZ` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | BoundingBoxXYZ | — | `public BoundingBoxXYZ ()` |
| Property | BoundEnabled | — | `public bool this [ int bound , int dim ] { get ; set ; }` |
| Property | Bounds | — | `public XYZ this [ int bound ] { get ; set ; }` |
| Property | Enabled | — | `public bool Enabled { get ; set ; }` |
| Property | IsSet | — | `public bool IsSet { get ; }` |
| Property | Max | — | `public XYZ Max { get ; set ; }` |
| Property | MaxEnabled | — | `public bool this [ int dim ] { get ; set ; }` |
| Property | Min | — | `public XYZ Min { get ; set ; }` |
| Property | MinEnabled | — | `public bool this [ int dim ] { get ; set ; }` |
| Property | Transform | — | `public Transform Transform { get ; set ; }` |